Revit 2026 API

# SelectionChangedEventArgs Class

---

The event arguments used by the SelectionChanged event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPISingleEventArgs Autodesk.Revit.UI.EventsSelectionChangedEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SelectionChangedEventArgs : RevitAPISingleEventArgs
```
```vb
Public Class SelectionChangedEventArgs
	Inherits RevitAPISingleEventArgs
```
```cpp
public ref class SelectionChangedEventArgs : public RevitAPISingleEventArgs
```
```fsharp
type SelectionChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
```

The SelectionChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDocument | Returns the document associated with this event. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetReferences | Returns the references that are currently selected. |
|  | GetSelectedElements | Returns ElementIds of selected elements. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace